test/fixtures/vcr_cassettes/v16/bill/pay.yml

---
http_interactions:
- request:
    method: post
    uri: http://api.regalii.dev/bill/pay
    body:
      encoding: UTF-8
      string: '{"biller_id":14,"account_number":"6463060086","user_id":12981,"amount":99,"currency":"DOP"}'
    headers:
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - application/vnd.regalii.v1.6+json
      User-Agent:
      - Regaliator gem v4.2.0
      Content-Type:
      - application/json
      Date:
      - Tue, 01 Aug 2017 20:07:57 GMT
      Content-Md5:
      - xJsmPjqUPl5GbiY8FJOi4w==
      Authorization:
      - APIAuth testing:wef2mNjRCsHxMXdzhOVKekEypYE=
  response:
    status:
      code: 201
      message: Created
    headers:
      Cache-Control:
      - no-store, must-revalidate, private, max-age=0
      Content-Type:
      - application/json; charset=utf-8
      Server:
      - thin 1.5.1 codename Straight Razor
      Set-Cookie:
      - __profilin=p%3Dt; path=/
      X-Content-Type-Options:
      - nosniff
      X-Frame-Options:
      - SAMEORIGIN
      X-Miniprofiler-Ids:
      - '["7xow4niq6l4oflkx1j91","hi0oyl4yj3yid5dshdia","6ejb8nwplj473si59e1c","t0azwm8co5tcpswi3lqt","5jk98du3pxcinwjuyyqj","f6ie1t3880amk296nfwc","x1qlxjnutp0728apmxj6","jkfak7i0nzmjdnarmo41","par6uhs6oernbjlzomwk","8xscqsrev8aocsgmzyk9","ig0e1e38gmfvti5mz9t8","l130ii42kwrbytazzoiq","5zmprn500dlfwvfvcnce","4s2qv2z3bs3onhxjttto","ncvfjrroe7f5q0a9zdir","zbb7cd01oqbect094lj2","y8h7wxjgyjn5y8lldy45","oyojf2wwrtzgs2oq6kui","jtp7rxty49srbnvs81vi","aeexy9e3en4wn9c0tjgk"]'
      X-Request-Id:
      - 9995a012-3adc-410b-b6b9-ba1d4c3fb29c
      X-Runtime:
      - '0.100347'
      X-Xss-Protection:
      - 1; mode=block
      Date:
      - Tue, 01 Aug 2017 20:07:57 GMT
      Content-Length:
      - '581'
    body:
      encoding: UTF-8
      string: '{"id":12325939,"external_id":null,"biller_id":14,"account_number":"6463060086","bill_amount":99.0,"bill_amount_currency":"DOP","fx_rate":46.5892,"bill_amount_usd":2.13,"bill_amount_chain_currency":2.13,"payment_transaction_fee":3.0,"payment_total_usd":5.13,"payment_total_chain_currency":5.13,"chain_earned":2.0,"chain_paid":3.13,"starting_balance":-10947.78,"ending_balance":-10950.91,"hours_to_fulfill":0,"sms_text":null,"created_at":"2017-08-01T20:07:57Z","bill_amount_local_currency":4612.3308,"local_currency":"RD","ticket_text":"Pago
        realizado exitosamente Auth: 1501618077"}'
    http_version: 
  recorded_at: Tue, 01 Aug 2017 20:07:57 GMT
recorded_with: VCR 3.0.3
